var works = {
    allQuestions: [100, 200, 500, 1000],
    100: {
        question: "В чем разница между null и undefined?",
        answers: [
                "1 - У этих значений разные типы данных",
                "2 - В этих словах разное кол-во букв",
                "3 - Это разные языки программирования",
                "4 - null ушёл ловить рыбу, а undefined ещё не опредлился",
        ],
        aRight: 1,
    },
    200: {
        question: "Для чего используется оператор &&?",
        answers: [
                "1 - Находит значения всех операндов, если их значения истинные",
                "2 - Находит и возвращает true, если хотябы одно значение не верно",
                "3 - Находит и возвращает первое ложное значение либо последний операнд, когда все значения истинные",
                "4 - Находит и возвращает первое истинное значение.",
        ],
        aRight: 3,
    },
    500: {
        question: "Для чего используется оператор ||?",
        answers: [
                "1 - Находит и возвращает первое ложное значение либо последний операнд, когда все значения истинные",
                "2 - Осуществляет поиск на сайте",
                "3 - Находит и возвращает true, если хотябы одно значение не верно",
                "4 - Находит и возвращает первое истинное значение.",
        ],
        aRight: 4,
    },
    1000: {
        question: "Что такое DOM?",
        answers: [
                "1 - это место, где живёт моя кошка",
                "2 - это прикладной программный интерфейс для работы с HTML и XML документами",
                "3 - это структура страницы, которую сверстали из макета",
                "4 - это аббревиатура спецлужб, которые ломятся ко мне в дверь",
        ],
        aRight: 2,
    }
};

